app/controllers/viewallairports_controller.rb

SELECT * FROM `airports` WHERE (longitude > -122.79007 AND longitude < -121.210785 AND latitude <= 38.237101 AND latitude >= 37.398528 AND airport_type = 'AIRPORT')
---
 def clustered_airports
 	ne = params[:ne].split(',').collect{|e|e.to_f}
 	sw = params[:sw].split(',').collect{|e|e.to_f}

 	# Get all airports
  airports = Airport.find :all,
    :conditions => ["longitude > ? AND longitude < ? AND latitude <= ? AND latitude >= ? AND airport_type = 'AIRPORT'", sw[1],ne[1],ne[0],sw[0]]